# タイトル
モブプログラミングを導入し4ヶ月で新規サービスを開発/リリースした開発手法

# 内容
```
新規開発は特に不確実な事が多く以前からスケジュール管理やプロセス周りの最適解がわからず苦労する事が多く大変な思いをしてきました。
サービスとして堅牢性・可用性が特に求められるプロジェクトでは
スピードを重視し仮説検証を繰り返しながら学びを醸成していくアジャイル開発を敬遠して来ましたが
開発プロセスを一新し開発者体験をあげる事で新規開発でもアジャイル開発を実施できました
当セッションではその開発プロセスを一新したお話をしたいと思います。
```

# 概要
```
 # 課題解決の為に実際に取り組んだこと
 - モブワーク導入
     - 属人化排除の為全体アーキテクチャ設計、詳細設計、全ての過程でモブワークを導入
 - 不確実性を意識したプロジェクト管理
     - クリティカルチェーン・プロジェクトマネジメントを導入してのアジャイル開発
         - 不確実性が高い機能はコンセプト実装などを行った
 
 # 伝えたい事
 - 全体設計もモブワークしたことにより思考の伝搬がスムーズに行えた
 - Developer eXperienceを意識したおかげで開発メンバーのモチベーションが高い所で維持できた
 - アジャイル開発でも設計は大事
 - デベロッパーが推進するDXと開発プロセスの変革について
     - アジャイル開発＋モブワークは親和性が高く品質を維持しながら価値提供できる
```
