2020年も半年が過ぎライフスタイルや業務にも慣れてきた方が多いと思いますが、そんな中、社の組織変更に伴い2020年4月からエンジニアリングマネージャー(以下EM)になりました。以前はスクラムマスタ兼バックエンドエンジニアとして働いていたので、やや不安もありましたが3ヶ月たった現在、なんとかやってます笑。そこでEMとして3ヶ月たった現在の課題や感想等まとめたいと思います。

因みに、便利上EMと定義していますが社での職名はテクニカルマネージャーとなっています。
え？なんでテクニカルマネージャー？？EMで良くね？って突っ込みたくなりますよね？
なりますね？？(突っ込みたかったけど時既に遅しでした)

# 主な業務

私が関わっているプロダクトチームは3つあり、規模はもちろんの事ウォータウォール開発もあればスクラム開発、オフシェア開発と様々です。チームへの干渉も全部同じではなくチーム状態によって変えていて1人1人と向き合う事を意識しマネジメントしています。

本題となる主な業務ですが以下です

## ピープルマネジメント
1on1の実施や勤怠管理を行っています。1on1は業務形態関係なく実施しておりメンバーの状態によって何が今最適なのか考えながらやっていますが正直まだ手応えはありません。。

### 目標管理

個人で動く事よりチームとして動き達成して欲しかったのと、トラッキング方法等のプロセス設計や目標設定して終わりかねないと判断した為個人目標を設定しておらず、プロダクト目標としてOKRを作成しトラッキングしています。

※目標がない事でどう作用するのかは冷静に振り返りたいと思っています

## PjMとしての動き
全体スケジュール管理はもちろんの事、売上/利益を意識し、チーム全体(開発メンバー以外も)へ目標達成に向け促しています。また全体の問題提起及び課題の顕在化も行い、各メンバーが課題解決できるよう最初に全体の事を話し、私が咀嚼した内容を付け加える形で共有しています。

# 行動指針及び大切にしている事

自分の軸がぶれないようEMとして大切にしている事を掲げ、行動指針としてメンバーに対しコミットしました。行動指針に即した行動をしているか月1で振り返りを行い確認しています。

## 1人1人と向き合う
主な業務でも記述しましたが1人1人と向き合う事を大切にしています。サーバントリーダーシップに努め、決めるべきことを決め、誰よりも早く向かうべき方向に走り引っ張るよう心がけます

## 場を整える
ステークホルダーとの対話、調整業務等、パフォーマンス上げる為の環境作りに尽力し学びのサイクルを効果的に回していきます

参考：
[https://scrapbox.io/nishio/%E5%AD%A6%E3%81%B3%E3%81%AE%E3%82%B5%E3%82%A4%E3%82%AF%E3%83%AB:title]



## 人間関係から逃げない
人間関係のメンテナンスから逃げす、面倒とか言わない、嫌な顔しない • 問題事は早めに解決します。

# 課題

新米という事もあり課題は多く、、

## MTGが多い、とにかくに多い
MTGに忙殺されないように努めていましたが、しっかり忙殺され、空き時間が週3時間程しかないです。。世のマネージャーという名がつく方共通の課題ですよね。どうすれば減るんだろう。。

## 権限委譲や課題解決
チームをスケールするにあたり権限委譲を適切に行いたいと考えています。要はバランスと言ったらそこまでですが、委譲するにしてもどこまで介入したらいいのか判断が難しく塩梅がわかっていません。介入する際は以下を意識していますが、正直正しいか全くわかりません。

- 問題箇所を認知していない、助言を求めてくる場合は介入
- 決定後ロールバックが困難な問題じゃない場合は委譲者の判断に任せ介入しない
    - ロールバックが可能なら失敗は学びになると考えています
- 1on1でお互いの期待を合わせどこまで介入するか、しなくていいかを明確にする

またチームを意識するあまり技術周りが疎かにならないか懸念しています

※ある日のつぶやき
[f:id:primunu:20200710142109p:plain]


## EMじゃなく全体のマネージャーっぽくなっている
課題というか感想に近いですが現在チームが抱えている課題の多くがビジネス側にありプロダクト全体の課題解決も促しているので、EMというよりは全体のマネージャーっぽくなっています。嫌と言うわけじゃないのですがこれでいいのか？と疑問は正直あります。

# 感想

新型コロナウイルスの影響で4月から現在までリモートワークで業務を行っているのと相まって、チームビルディングや、初めてコミュニケーションを取る方との同期が難しいと感じました。成果はまだ現れていませんが現在の課題を1つ1つ解決しながら自分自身も成長できてたら考えていて全体的に学習する事や学びが多く飽きずにやれています。

一方でまだ評価が入って来てないので評価者としての不安があったりプログラミングや技術的な所に時間が取れずエンジニアとして弱くなっていてるのでEMとエンジニア、両方のバランスを取りながらスキルをあげて行きたいです。

10行程度に収めようと思ったのに結果長くなってしまった。。

