この記事は、[mediba Advent Calendar 2020 19日目](https://qiita.com/advent-calendar/2020/mediba)の記事です

medibaのエンジニア組織に所属している下地です。
2020年、COVID-19の影響でリモートワークになった組織は多いと感じています。
弊社も例外ではなく3月からリモートワークが始まり、4月からは完全にリモートワークとなりました。
現在もリモートワーク中心としたワークフローで業務しています。

そんな2020年の働き方として定着したリモートワークですが
try and error を行いながらチームで改善し現在に至ります。
その振り返り記事になります。

# リモートワークが始まる前は？

リモートワークをやっている会社？羨ましいわー、私とは関係な話だわ。。という感想だったのを強く覚えています。
チームではリモートワークしたい！派とオフィスで仕事したい派、私の観測だと半々でした。

※エンジニアだけで言うとリモートワークしたい派が7割くらいでした

この時はリモートワークは憧れで、私とは無縁だと思っいて、子供が小さいし仕事に集中できないから、リモートワーク初期の私は出勤しますわーと言っていたのを覚えています。何かにつけて言い訳していた自分自身が恥ずかしいです笑

そんな憧れのリモートワーク。
COVID-19の到来。半ば強制的にリモートワークがスタートします。

# リモートワークが始まった。プライベートでの影響は？

まず最初に気づいたメリットですが、電車に乗った通勤をしません。当たり前ですね。
ですが、これがQoLをかなりあげる事になります。
家事・育児に参加でき、今まで土日限定だった子供とのお風呂も毎日入れるようになり、
負担は増えましたが満足しています。
出社とは？電車乗るのがこんなにも面倒なのか？人類に通勤とういうのは不要なのでは？
と錯覚する程電車通勤が面倒と感じました。これは今でも面倒だと感じています。。

ただし、デメリットもあり…習慣化していた電車での読書タイムがなくなりました。
時間を捻出しようにも始業、就寝ギリギリまで家事・育児をしていることが多く時間が取れません。
INPUTの時間が減る事で不安もあったので、家族に相談し、今では始業30分前を読書 or INPUTの時間とし確保しています。
永遠の課題だとは思いますが、学習と家事/育児のバランスはとても難しいです。

# 業務の影響は？

結論から言って幸いな事に問題は殆どありませんでした。
主な要因は下記です。

## リモートワークが始まる半年程、現チームで稼働していた

モブプログラミングを推奨したチームだった事もあり対面で話す事が多く、コミュニケーションを多く取ってきました。
おかげか、リモートワークが始まっても意思疎通は円滑に行え、ワークフローも特に変更する事なくリモートワーク主体の業務に切り替える事ができました。

モブプログラミングのおかげで1人で作業する事も少なく、リモートワークにおける”孤独”という課題も解消できたの、
でチームにとってモブプログラミングは良い効果があったと感じています。


## チームとしても成熟していてた

モブプログラミングの効能のあったんですが、
1番の理由はコレだと感じています。

チームはタックマンモデルのおける機能期にいた事もあり、業務を自分ごと化し業務に尽力していたと感じています。
自己組織化というよりはセルフマネジメントができる集団の方が感覚は近いかもですが
リモートワークでもパフォーマンスはあまり変わりませんでした。

# 業務の影響は殆どなかった。と言いつつも問題は起こるわけで、、、

スクラム開発をしているのですが主なイベントが時間通り終わらなくなりました。
…少し盛りました、正確に言うと<b>全てのスクラムイベント</b>が時間通り終わらなくなりました。

改善方法はというと、、やった事は単純でチームで
話し合って時間内に終わらせるよう話した、ただそれだけです。
個人の意識を変えるだけで終わるようになるもんですよね。
ただ、それでも時間通りに終わらなかったイベントがあり、それがスプリントレトロスペクティブになります。

スプリントレトロスペクティブはFDLをフレームワークとして採用し、
apinoteで疑似付箋ワークをしていたのですが、画面の切り替えや、発表する内容が多い場合どうしても
時間を押してしまう事が多かった事もあり、
発表する付箋の数を制限する事で時間通り終わせるようになりました。
制限することで意見がでにくい、しにくい等ありましたが逆に意見する事を
よく考えるようになった意見もあり1ヶ月やってみた所
特段問題もなかったので現在もこの形で運営しています。

## 働きすぎ問題

サボる人が(ry と巷では言われていましたが
逆で、個人差はあるもののサボる人より圧倒的に働きすぎ方の方が多いと感じています。
しかも退勤後に業務にあたるという、、。業務柄、仕事とプライベートの区別が難しく。。当時悩んでいたツイートがコレ。

[f:id:primunu:20201222172749p:plain]

https://twitter.com/primunu/status/1335552239696429057


※このブログも飲みながら飲みながら書いてます。やばいやつですね、はい

## メンタルケア、、ムズカシイ。そんな中、工夫した事とは？

私のロールがマネージャーという事もあり
1on1はメンターとして参加する事が多いです。
出勤していると雑談等の軽い相談は比較的に簡単に行う事ができますが、リモートワークだとそうは行きません。雑談するにも時間を抑え、、、等の
工程が必要になるので一苦労です。
その為1on1ではあえて雑談7割、3割業務の話をしていました。
固定で何かしらの息抜きできる時間があればと考え雑談ばかりしていましたが、これが正しいの今でもかわかりません。
少なくともリモートワークにはリモートワークの1on1のスタイルがあるのでは？と考えていますが、まだまだ
納得言っていないので改善が必要ですね。。。

# まとめ

リモートワークという働き方は私の生活を大きく変えました。
現時点ではリモートワークという働き方にはとても満足しています。
メンタルケアの課題は2021年の宿題となりますが、
チームにあった改善を推進し、働きやすい環境を自分たちで作って行ければと考えています。

それでは良い開発ライフを！


