こんにちは。下地と申します。

私のロールはエンジニアリングマネージャー(以下、EM)なのですが、EMと言っても組織によってコミットする領域や振る舞い等が違うと思います。そこでmedibaにおけるEMとしての業務内容をまとめ、どの領域にコミットしているのかを整理したいと思います。

※他EMとやり方を同期しているわけではないのであくまで私がEMとして実施している範囲の解説になります。予めご了承下さい。

# 主な業務

medibaにおけるEMはピープルマネージメントを軸にしておりプロダクトに1人のEMを配置しチームを運営しています。主な業務としてピープルマネージメント、組織運営、プロダクト開発の3領域にわける事ができます。

## ピープルマネージメント

メンバー（ヒト）に向き合い、成長や育成にコミットすることで、組織の成果を最大化する事を目指します。ただ、成長や育成はあくまで個人に依存していると考えているので主に場を整えたり、作る事を意識し支援する事を重点に置いています。

### 1on1の実施

毎週30分メンバーと話しています。話す内容はメンバーによってバラバラで雑談や、趣味、業務のお困りごと、目標等についてお話します。リモートワーク中心の業務なのでメンタルチェックも兼ねて実施しています。

### 各メンバーの成長支援の創造

コンフリクトの解消や場を整備しパフォーマンスが出せる環境を提供するよう心がけ支援します。私の考える理想のEM像は部活動におけるマネージャーなので、雑務やパフォーマンスに影響がある箇所は1on1を通し情報収集を行い対応します。

## 組織運営

ミドルマネージャーの主な業務が詰まっている領域です。medibaのEMも例外ではありません。詳細は割愛しますが、評価は良いところにフォーカスし価値を高めていく事を意識しています。

*   評価
*   採用面接
*   組織KPIのコミット
*   広報活動

## プロダクト開発

書籍、ティール組織にある”助言プロセス”を取り入れフォローしています。

```
助言プロセスとは

原則として、組織内のだれかがどんな決定も下してもかまわない。
ただしその前にすべての関係者とその問題の専門家に助言を求めなければならない。
決定を下そうという人には、一つ一つの助言をすべて取り入れる義務はない

※書籍"ティール組織 ― マネジメントの常識を覆す次世代型組織の出現"から抜粋
```

### プロダクト、メンバーのボトルネックの解消

開発プロセスや、プロダクトの課題解決は助言プロセス主体で進めるものの、プロダクト全体のボトルネックや、他職能マネージャーとの調整やメンバー間のトラブル解消等は全体を俯瞰して見ているEMが対応します。このボトルネックの解消は、EMの多岐に渡る業務の中で1番優先度が高い業務としています。

### 意思決定が必要なMTGへの参加

施策出しやリリース等々のMTGはあまり参加しないものの意思決定が必要なMTGには積極的に参加しています。テキストで対応するより会話した方が意思も伝えやすいと考えています。

### 障害時の取りまとめ

EMが指揮を取り影響範囲等を調査報告します。他マネージャーとの連携が必要なのと最終的にEMが報告するので積極的に対応します。

### プロジェクトマネージャー業務

メンバーが実施する事もありますが他マネージャーや他部署との連携が必要な場合EMが対応します。

### 技術選定

組織としての技術選定の観点として売上/利益、今後の展望、成長のバランスを意識し事業内容でどこにBETするかを判断しています。売上/利益重視なら得意なスタック、今後の展望を重視するなら既存スタックにとらわれず最適なスタックを選定といった具合です。

# まとめ

medibaの主なEM業をまとめて見ましたが如何でしょうか？私自身はコードを書く業務には携われていないのでハードスキルが止まっているものの、1on1等で視座があがっていくメンバーや、仕事が楽しいと言ってくれるメンバー、業務の幅を広げ活躍できる領域を広げるメンバー等の成長を近くで実感できるのは非常に気持ちがよくEMのやりがいを感じます。

今回は組織運営パートの詳細は割愛していますが機会があれば言語化したいと思います。

最後になりますが、現在medibaでは[EMを募集](https://hrmos.co/pages/mediba/jobs/900000077)をしています。
少しでも興味を持って頂けたら応募してもらえると幸いです。

# 余談

[EMトライアングル](https://github.com/engineering-manager-meetup/engineering-management-triangle)
とはEMの役割をグラフィックモデル化したものです。以下の図はEMトライアングルに主な作業領域に色をつけ可視化したものになります。medibaではTechnology - Team領域を主軸に活動している事もあり全領域を網羅する形となっています。こちらも参考にして頂けると幸いです

![](https://64.media.tumblr.com/e4d92ff88082d85d7f9b7e85f4736681/ecb8aea5a5c76113-d8/s540x810/b9ec7d30e43c66e7daa4fd9c30de1e19d1cc0360.png)
