2019年10月頃から課題解決のために1on1を行っているのですが
1on1の詳細なやり方等の情報が少なく感じたので現時点で意識している事を書き留めたいと思います。

※1on1とは何か等々の細かい説明は割愛します

# 意識/工夫している事

ただ1on1をするのも勿体ないので学びのサイクルを回し知見をためたいと思っています。
そこでよく意識し実践している事が下記になります。

### リフレーミングを意識する

普段からリフレーミングをするようにしているが1on1の時はより一層意識しています。褒められて悪い思いをする人はいないですよね。

### ティーチングではなくコーチングをする。時にはカウンセリングする
 
1on1を通じてメンターの目標達成や成長促進を支援したい事からコーチングを行いたいと思っています。
ただコーチングをする以前の問題(ストレスフルだったり)もあり場合によって使い分けるようにしています。

今の頻度としては以下。もっとコーチングしたい。。
```
カウンセリング >>> ティーチング > コーチング 
```

### 答えをすぐに言わない

成長促進を支援したいので間違っててもいいから答えをメンターの言葉で語ってもらいます。
なお、的外れな事を言われても”こういう考えはどう？”と言った対応を行う。否定だめ絶対。
    
### 時間の8割以上は相手に話をさせる

1on1はメンターの時間です。メンティーは傾聴するべきです。
傾聴する場合はロジャーズの3原則を意識しています。

### 次のアクションを提示させる

次回の1on1に向けアクションを1つメンターから提示してもらっています。
複数のアクションだとアクションへの意識が弱まると思っているので1つを徹底しています。
前回の1on1の振り返りにもなるので学びのサイクルを促せるのでは？と思っています。

### Scrapboxを見ながら話す

もちろんログを残す目的もありますが文字に起こすとメタ認知しやすいと思っています。
書いた内容をすぐ書くのでメンターの話を聞いてもらっていると認知してくれるんじゃないかと。
今の所メモ的なサービスは今の所Scrapbox最強。

### メンターからのお願い

メンターから何かしらのお願いをされた場合遅くても2日以内に対応するよう心がけています。レスポンスが早いのは信頼関係を構築する要素としてはとても大事。
    
# 1on1の流れ

上記を踏まえて1on1を行っています。
時間は30分程を想定しているんですが30分で終わらない事がとても多いです。
課題と言えば課題なんですがメンターが気持ちよく喋っているのに無理やり終わるのもなぁ。。

1. アイスブレイク
1. 前回のアクションのフィードバック
1. ティーチング/コーチング/メンタリング
1. 次回のアクション提示

※ 時間があまった場合メンティーにお願いしたいことはあるか聞いています

因みに初めての1on1の場合以下をメンターに話すようにしています

- メンティーのための時間ではないメンターの時間と伝える
- なぜやるのか、目的を説明する
- お互いの期待を明確にする

# 課題だと感じている事

メンティーの成長を感じたり、1on1の時間が楽しみだと言ってくれているので
手応えはあるものの私自身1on1のメンティ/メンターの経験が乏しく** 何が正解わからないのが1番の課題 ** です。
また私のスキル不足がゆえコーチングがうまくできないといった課題もあります。
もう少し知見、経験を貯めればと思います。

# まとめ

現時点の考え方を明文化したのでこれをベースに1on1の改善ができたらなと思っています。
自分の課題も解決しながら1on1のスキルアップを図りたいです。

さいごに、、1on1熟達者の方の意見が欲しい。