コロナで色々あった2020年。さっそく振り返って行きます。

## 目標関連

ブログ執筆は4つ、読了した本は3冊。
目論には全然足りなかったわけだが、ネタがないわけではなく家事・育児、不慣れな業務などで
時間を吸われました。来年はもう少し時間を捻出できるようにしたいですね。。

## 1月〜3月

- 約1年ぶりに転職ドラフトにエントリーした。開発をあまりしていなかったか、コロナのせいなのか原因はわからないが
オファー0で凹む。
- 初めての360度評価が想像以上に大変(コメントしたのは13人程)で評価は大変だと実感。1人あたり20分かけて書いたけど業務時間外に書くしかなく辛かった。
 

## 4月〜6月
- ロールがマネージャーに変わった。やること変わらないだろうと思っていたけど全然そんな事なかった。見るプロダクトが3つになった事もあり1日中MTGが当たり前になってしまった。
業務がMTGにでる事なので、開発者として生産性がゼロになり不安な毎日を過ごす(これは今もそう)
- 業務量が多すぎるが故、全ての業務に全力で取りかかれなくなってきた。そこであるプロダクトにたいし何もしない選択肢を取るようになった。それでも1日中MTGは変わらなかった。
- ただ業務を回すことはしたくなかったのでプライベートな時間の殆どを仕事関連で消費

## 7月〜9月
- 2度目の360度評価。相変わらず辛い
- メンバーの評価を自分なりにまとめたりした。慣れていないのと言語化能力が低いせい、掛けた時間は1人あたり約3時間程。
- 楽しむ事が難しくなってきた。けど楽しむ、楽しむにはどうしたら良い？といった事をscrapboxに書き溜めるようになった。多分病んでました笑
- アウトプットださなきゃ、ださなきゃと思っていたがその思考を辞めた。できない自分を受け入れるようになった。

## 9月〜12月
- 所属チームの問題を解決すべくチームをわける案を思いつく。9月から構想し12月に実施。チームの状態を鑑みて12月にしたが複数の課題を解決できたようで良かった。2pizzaルール大事です
- 初めてアドベントカレンダーの記事を書いた。約8時間くらいかけた。
- 家の開発環境が弱々なので強強にすべく装備を整え始めた
- MTGが減ってきた、、キガスル。

## 総括

アウトプットを少しでも増やしたいと思った2020年でしたが、1つのブログを書くにも10時間程かかったりと言語化能力が低い事に改めて気づけた。ここをスタートラインとして腐れる事なくやっていきたいです。

リモートワークの影響でデブに拍車がかかってきたので来年は健康に投資したい。

そんな2020年でした。今年もお疲れさまでした！

